; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v3 ?v8)
             (pred_4 ?v2 ?v1)
             (pred_1 ?v3 ?v1)
             (pred_10 ?v13 ?v3 )
	     (pred_12 ?v3)
             (pred_3 ?v4)
             (pred_6 ?v2)
             (pred_7 ?v1)
             (pred_9 ?v3)
             (pred_8 ?v2)
             (pred_5 ?v3)
             (pred_2 ))



(:action op_4
:parameters (?v10 ?v9 ?v5 ?v12)
:precondition (and (pred_3 ?v10) (pred_3 ?v9) (pred_6 ?v5) (pred_7 ?v12)
          (pred_11 ?v10 ?v9) (pred_4 ?v5 ?v12)
                   (pred_1 ?v9 ?v12) (pred_12 ?v10) 
                   (pred_9 ?v9) (pred_8 ?v5))
:effect (and  (pred_5 ?v9) (not (pred_9 ?v9))))


(:action op_5
:parameters (?v10 ?v11)
:precondition (and (pred_3 ?v10) (pred_3 ?v11)
               (pred_12 ?v10) (pred_11 ?v10 ?v11) (pred_5 ?v11))
:effect (and (pred_12 ?v11) (not (pred_12 ?v10))))

(:action op_3
:parameters (?v10 ?v5)
:precondition (and (pred_3 ?v10) (pred_6 ?v5) 
                  (pred_12 ?v10) (pred_10 ?v5 ?v10) (pred_2 ))
:effect (and (pred_8 ?v5)
   (not (pred_10 ?v5 ?v10)) (not (pred_2 ))))


(:action op_1
:parameters (?v10 ?v7 ?v6)
:precondition (and (pred_3 ?v10) (pred_6 ?v7) (pred_6 ?v6)
                  (pred_12 ?v10) (pred_8 ?v6) (pred_10 ?v7 ?v10))
:effect (and (pred_8 ?v7) (pred_10 ?v6 ?v10)
        (not (pred_8 ?v6)) (not (pred_10 ?v7 ?v10))))

(:action op_2
:parameters (?v10 ?v5)
:precondition (and (pred_3 ?v10) (pred_6 ?v5) 
                  (pred_12 ?v10) (pred_8 ?v5))
:effect (and (pred_2 ) (pred_10 ?v5 ?v10) (not (pred_8 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_09 obj_03 obj_15 obj_24 obj_26 obj_19 obj_30 obj_05 obj_16 obj_25 obj_18 obj_22 obj_28 obj_01 obj_21 obj_27 obj_20 obj_17 obj_06 obj_12 obj_13 obj_29 obj_08 obj_23
    obj_02 obj_07
    obj_11 obj_10 obj_14
    )

    (:init
       (pred_2)

       (pred_3 obj_04)
       (pred_3 obj_09)
       (pred_3 obj_03)
       (pred_3 obj_15)
       (pred_3 obj_24)
       (pred_3 obj_26)
       (pred_3 obj_19)
       (pred_3 obj_30)
       (pred_3 obj_05)
       (pred_3 obj_16)
       (pred_3 obj_25)
       (pred_3 obj_18)
       (pred_3 obj_22)
       (pred_3 obj_28)
       (pred_3 obj_01)
       (pred_3 obj_21)
       (pred_3 obj_27)
       (pred_3 obj_20)
       (pred_3 obj_17)
       (pred_3 obj_06)
       (pred_3 obj_12)
       (pred_3 obj_13)
       (pred_3 obj_29)
       (pred_3 obj_08)
       (pred_3 obj_23)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_6 obj_14)

       (pred_11 obj_04 obj_26)
       (pred_11 obj_04 obj_09)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_09 obj_04)
       (pred_11 obj_03 obj_30)
       (pred_11 obj_03 obj_15)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_15 obj_03)
       (pred_11 obj_24 obj_16)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_26 obj_25)
       (pred_11 obj_26 obj_19)
       (pred_11 obj_26 obj_04)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_19 obj_30)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_26)
       (pred_11 obj_30 obj_22)
       (pred_11 obj_30 obj_05)
       (pred_11 obj_30 obj_03)
       (pred_11 obj_30 obj_19)
       (pred_11 obj_05 obj_28)
       (pred_11 obj_05 obj_16)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_05 obj_30)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_24)
       (pred_11 obj_16 obj_05)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_25 obj_18)
       (pred_11 obj_25 obj_26)
       (pred_11 obj_18 obj_27)
       (pred_11 obj_18 obj_22)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_25)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_28)
       (pred_11 obj_22 obj_30)
       (pred_11 obj_22 obj_18)
       (pred_11 obj_28 obj_17)
       (pred_11 obj_28 obj_01)
       (pred_11 obj_28 obj_05)
       (pred_11 obj_28 obj_22)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_01 obj_28)
       (pred_11 obj_21 obj_12)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_27 obj_13)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_27 obj_18)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_20 obj_29)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_17 obj_28)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_06 obj_23)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_21)
       (pred_11 obj_13 obj_29)
       (pred_11 obj_13 obj_27)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_29 obj_08)
       (pred_11 obj_29 obj_20)
       (pred_11 obj_29 obj_13)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_29)
       (pred_11 obj_23 obj_06)
       (pred_11 obj_23 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_06)
       (pred_9 obj_26)
       (pred_1  obj_12 obj_02)
       (pred_1  obj_06 obj_07)
       (pred_1  obj_26 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_15)
       (pred_5 obj_24)
       (pred_5 obj_19)
       (pred_5 obj_30)
       (pred_5 obj_05)
       (pred_5 obj_16)
       (pred_5 obj_25)
       (pred_5 obj_18)
       (pred_5 obj_22)
       (pred_5 obj_28)
       (pred_5 obj_01)
       (pred_5 obj_21)
       (pred_5 obj_27)
       (pred_5 obj_20)
       (pred_5 obj_17)
       (pred_5 obj_13)
       (pred_5 obj_29)
       (pred_5 obj_08)
       (pred_5 obj_23)

       (pred_4  obj_11 obj_02)
       (pred_4  obj_10 obj_07)
       (pred_4  obj_14 obj_07)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_10 obj_23)
       (pred_10 obj_14 obj_19)
       (pred_12 obj_23)
    )

    (:goal (and
       (pred_10 obj_11 obj_08)
    ))
(:constraints
  (always (not (pred_12 obj_17)))
)
)

; plan
1. (op_3 obj_23 obj_10)
   deleted: (pred_10 obj_10 obj_23) (pred_2)
   added: (pred_8 obj_10)
   goals met: 0 of 1
2. (op_4 obj_23 obj_06 obj_10 obj_07)
   deleted: (pred_9 obj_06)
   added: (pred_5 obj_06)
   goals met: 0 of 1
3. (op_5 obj_23 obj_06)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_06)
   goals met: 0 of 1
4. (op_5 obj_06 obj_01)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_01)
   goals met: 0 of 1
5. (op_5 obj_01 obj_16)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_16)
   goals met: 0 of 1
6. (op_1 obj_16 obj_11 obj_10)
   deleted: (pred_8 obj_10) (pred_10 obj_11 obj_16)
   added: (pred_8 obj_11) (pred_10 obj_10 obj_16)
   goals met: 0 of 1
7. (op_5 obj_16 obj_01)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_01)
   goals met: 0 of 1
8. (op_5 obj_01 obj_06)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_06)
   goals met: 0 of 1
9. (op_5 obj_06 obj_23)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_23)
   goals met: 0 of 1
10. (op_5 obj_23 obj_08)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_08)
   goals met: 0 of 1
11. (op_2 obj_08 obj_11)
   deleted: (pred_8 obj_11)
   added: (pred_2) (pred_10 obj_11 obj_08)
   goals met: 1 of 1
